# Rebar Get Crank Ratio Method

Source: https://www.revitapidocs.com/2026/43e99051-697b-e79c-4650-c5f596a23162.htm

---

| Rebar Get Crank Ratio Method |
| --- |

Gets the crank ratio at the indicated bar end.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetCrankRatio(
	int end
)
```

```
Public Function GetCrankRatio (
	end As Integer
) As Double
```

```
public:
double GetCrankRatio(
	int end
)
```

```
member GetCrankRatio :
        end : int -> float
```

#### Parameters

end Int32
:   The bar end.

#### Return Value

Double
Returns the crank ratio. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |
| InvalidOperationException | The bar does not have a valid Rebar Crank Type at the end. |

Remarks The crank slope is 1/crankRatio.
 If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type. See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace